Autodesk.Revit.DB.Architecture.RailingPlacementPosition
Railing placement position.
Since:
2013

Autodesk.Revit.DB.Architecture.RailingPlacementPosition.Stringer
Places railing on stringer.

Autodesk.Revit.DB.Architecture.RailingPlacementPosition.Treads
Places railing on treads.

Autodesk.Revit.DB.Architecture.RailingPlacementPosition.Undefined
No railing placement.